tutorials/unsymmetricalPipe/simpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1.0; 

vertices 
( 
	 ( 0.0 0.0 0.0 )	// 000
	 ( 0.025 0.0 0.0 )	// 001
	 ( 0.025 0.01 0.0 )	// 002
	 ( 0.0 0.01 0.0 )	// 003
	 ( 0.0 0.0 0.0005 )	// 004
	 ( 0.025 0.0 0.0005 )	// 005
	 ( 0.025 0.01 0.0005 )	// 006
	 ( 0.0 0.01 0.0005 )	// 007
	 ( 0.075 0.0 0.0 )	// 008
	 ( 0.075 0.01 0.0 )	// 009
	 ( 0.075 0.0 0.0005 )	// 010
	 ( 0.075 0.01 0.0005 )	// 011
	 ( 0.075 0.01044842266 0.0 )	// 012
	 ( 0.025 0.01044842266 0.0 )	// 013
	 ( 0.075 0.01044842266 0.0005 )	// 014
	 ( 0.025 0.01044842266 0.0005 )	// 015
	 ( 0.025 -0.0004484226599999995 0.0 )	// 016
	 ( 0.075 -0.0004484226599999995 0.0 )	// 017
	 ( 0.025 -0.0004484226599999995 0.0005 )	// 018
	 ( 0.075 -0.0004484226599999995 0.0005 )	// 019
	 ( 0.125 0.0 0.0 )	// 020
	 ( 0.125 0.01 0.0 )	// 021
	 ( 0.125 0.0 0.0005 )	// 022
	 ( 0.125 0.01 0.0005 )	// 023
	 ( 0.125 0.01044842266 0.0 )	// 024
	 ( 0.125 0.01044842266 0.0005 )	// 025
	 ( 0.125 -0.0004484226599999995 0.0 )	// 026
	 ( 0.125 -0.0004484226599999995 0.0005 )	// 027
	 ( 0.15 0.0 0.0 )	// 028
	 ( 0.15 0.01 0.0 )	// 029
	 ( 0.15 0.0 0.0005 )	// 030
	 ( 0.15 0.01 0.0005 )	// 031
); 

edges 
( 
	arc 2 9
		( 0.05 0.012 0.0 )
	arc 6 11
		( 0.05 0.012 0.0005 )
	arc 1 8
		( 0.05 0.002 0.0 )
	arc 5 10
		( 0.05 0.002 0.0005 )
	arc 13 12
		( 0.05 0.01244842266 0.0 )
	arc 15 14
		( 0.05 0.01244842266 0.0005 )
	arc 16 17
		( 0.05 0.0015515773400000005 0.0 )
	arc 18 19
		( 0.05 0.0015515773400000005 0.0005 )
	arc 9 21
		( 0.1 0.008 0.0 )
	arc 11 23
		( 0.1 0.008 0.0005 )
	arc 8 20
		( 0.1 -0.002 0.0 )
	arc 10 22
		( 0.1 -0.002 0.0005 )
	arc 12 24
		( 0.1 0.00844842266 0.0 )
	arc 14 25
		( 0.1 0.00844842266 0.0005 )
	arc 17 26
		( 0.1 -0.0024484226599999995 0.0 )
	arc 19 27
		( 0.1 -0.0024484226599999995 0.0005 )
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	( 50  20  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 1  8  9  2  5  10  11  6)	( 100  20  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 2  9  12  13  6  11  14  15)	( 100  1  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 16  17  8  1  18  19  10  5)	( 100  1  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 8  20  21  9  10  22  23  11)	( 100  20  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 9  21  24  12  11  23  25  14)	( 100  1  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 17  26  20  8  19  27  22  10)	( 100  1  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 20  28  29  21  22  30  31  23)	( 50  20  1)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
			( 1  8  9  2)
			( 5  10  11  6)
			( 2  9  12  13)
			( 6  11  14  15)
			( 16  17  8  1)
			( 18  19  10  5)
			( 8  20  21  9)
			( 10  22  23  11)
			( 9  21  24  12)
			( 11  23  25  14)
			( 17  26  20  8)
			( 19  27  22  10)
			( 20  28  29  21)
			( 22  30  31  23)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 0  3  7  4)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 28  29  31  30)
		);
	}

	walls
	{
		type wall;
		faces
		(
			( 0  1  5  4)
			( 3  2  6  7)
			( 2  13  15  6)
			( 13  12  14  15)
			( 16  1  5  18)
			( 16  17  19  18)
			( 12  24  25  14)
			( 21  24  25  23)
			( 17  26  27  19)
			( 26  20  22  27)
			( 20  28  30  22)
			( 21  29  31  23)
		);
	}

); 

mergePatchPairs 
( 
); 

