tutorials/unsymmetricalPipe/simpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.005;
        smoother        symGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 5;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance       1e-12;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0.05;
    }
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    5;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    
    //~ consistent         yes;
    consistent         no;
    
	outerCorrectorResidualControl
	{
		U
		{
			tolerance	1e-5;
			relTol		0;
		}
		p
		{
			tolerance	5e-4;
			relTol		0;
		}
	}
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent yes; //I changed this
    
    residualControl
    {
        p           1e-5;
    }

    HFDIB
    {
        surfaceType     setValue;
        boundaryValue   0.0;
        tolUEqn         1e-4;
        maxUEqnIters    10;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 12;
}

relaxationFactors
{
    fields
    {
        p           0.05;
        U           0.2;
        k           0.5;
        omega       0.5;
    }

    equations
    {
        ".*" 0.85;
    }
}

cache
{
    grad(U);
}
// ************************************************************************* //
